src/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ГруппыПользователей/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает массив групп пользователей в которых находится текущий пользователь
//
Функция ПолучитьМассивГруппПользователей(ТекущийПользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ГруппыПользователейСостав.Ссылка КАК ГруппыПользователей
	               |ИЗ
	               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |ГДЕ
	               |	ГруппыПользователейСостав.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);			   
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		МассивГруппПользователей = Новый Массив;
		МассивГруппПользователей = Результат.Выгрузить().ВыгрузитьКолонку("ГруппыПользователей");
		Возврат МассивГруппПользователей;
	Иначе
		МассивГруппПользователей = Новый Массив;
		Возврат МассивГруппПользователей;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
